src/KPSPublicYabanciDogrula.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <YabanciKimlikNoDogrula xmlns="http://tckimlik.nvi.gov.tr/WS">
      <KimlikNo>₺tc</KimlikNo>
      <Ad>₺ad</Ad>
      <Soyad>₺soyad</Soyad>
      <DogumGun>₺dogum_gun</DogumGun>
      <DogumAy>₺dogum_ay</DogumAy>
      <DogumYil>₺dogum_yil</DogumYil>
    </YabanciKimlikNoDogrula>
  </soap12:Body>
</soap12:Envelope>